In [1]:
# Pandas Library 

import pandas as pd

In [7]:
# Checking the version of panda 

pd.show_versions()

C:\Users\nural\Anaconda3\lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 7c48ff4409c622c582c56a5702373f726de08e96
python           : 3.9.13.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22631
machine          : AMD64
processor        : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.2.5
numpy            : 1.21.5
pytz             : 2022.7
dateutil         : 2.8.2
pip              : 23.0.1
setuptools       : 67.6.1
Cython           : 0.29.32
pytest           : 7.1.2
hypothesis       : None
sphinx           : 5.0.2
blosc            : None
feather          : None
xlsxwriter       : 3.0.3
lxml.etree       : 4.9.1
html5lib         : 1.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.3
IPython          : 7.31.1
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : 1.3.5
fsspec           : 2022.7.1
fastparquet      : None
gcsfs            : None
matplotlib       : 3.5.2
numexpr          : 2.8.3
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : None
pyxlsb           : None
s3fs             : None
scipy            : 1.9.3
sqlalchemy       : 1.4.39
tables           : 3.6.1
tabulate         : 0.8.10
xarray           : 2022.11.0
xlrd             : 2.0.1
xlwt             : None
numba            : 0.55.1

In [8]:
# Creating DataFrames Using Pandas Example 1

ages =[41,56,56,57,39,59,43,56,38,60]

In [9]:
pd.DataFrame(ages)

    0
0  41
1  56
2  56
3  57
4  39
5  59
6  43
7  56
8  38
9  60

In [10]:
df_ages =pd.DataFrame(ages)

In [11]:
df_ages.head(3)

    0
0  41
1  56
2  56

In [12]:
df_ages.head()

    0
0  41
1  56
2  56
3  57
4  39

In [15]:
# Adding Name to Age Dataframe 

data ={
    "Name":["Liu","Robin","Rosa","Rice","Scott","David","Kerr","Hatch","Mike","Lily"],
    "Age":ages
}
print(data)

{'Name': ['Liu', 'Robin', 'Rosa', 'Rice', 'Scott', 'David', 'Kerr', 'Hatch', 'Mike', 'Lily'], 'Age': [41, 56, 56, 57, 39, 59, 43, 56, 38, 60]}

In [16]:
df_sample = pd.DataFrame(data)

In [17]:
df_sample.head()

    Name  Age
0    Liu   41
1  Robin   56
2   Rosa   56
3   Rice   57
4  Scott   39

In [18]:
df_sample.tail()

    Name  Age
5  David   59
6   Kerr   43
7  Hatch   56
8   Mike   38
9   Lily   60

In [19]:
# Checking Number of Columns in Dataframe

df_sample.columns

Index(['Name', 'Age'], dtype='object')

In [20]:
df_sample.index

RangeIndex(start=0, stop=10, step=1)

In [21]:
df_sample.set_index("Name", inplace=True)

In [22]:
df_sample

       Age
Name
Liu     41
Robin   56
Rosa    56
Rice    57
Scott   39
David   59
Kerr    43
Hatch   56
Mike    38
Lily    60

In [23]:
# EDA = Exploratory Data Analysis 
# DS-ML Project = Import Libraries, Load the dataset, EDA

In [24]:
# Collecting Data Information 

df_sample.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Liu to Lily
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     10 non-null     int64
dtypes: int64(1)
memory usage: 160.0+ bytes

In [25]:
# Summary Statistics/Descriptive Statistics 

df_sample.describe()

             Age
count  10.000000
mean   50.500000
std     9.009255
min    38.000000
25%    41.500000
50%    56.000000
75%    56.750000
max    60.000000

In [26]:
# T Format Outlook 

df_sample.T

Name  Liu  Robin  Rosa  Rice  Scott  David  Kerr  Hatch  Mike  Lily
Age    41     56    56    57     39     59    43     56    38    60

In [27]:
# Doubling Ages of first three people

df_sample.multiply(2).head(3)

       Age
Name
Liu     82
Robin  112
Rosa   112

In [28]:
# Dividing Ages by 2 

(df_sample/2).head(3)

        Age
Name
Liu    20.5
Robin  28.0
Rosa   28.0

In [29]:
# Multiplying DF X DF

(df_sample * df_sample).head(3)

        Age
Name
Liu    1681
Robin  3136
Rosa   3136

In [30]:
# Checking ages > 40 

df_sample > 40

         Age
Name
Liu     True
Robin   True
Rosa    True
Rice    True
Scott  False
David   True
Kerr    True
Hatch   True
Mike   False
Lily    True

In [31]:
# Checking ages <20 

df_sample < 20

         Age
Name
Liu    False
Robin  False
Rosa   False
Rice   False
Scott  False
David  False
Kerr   False
Hatch  False
Mike   False
Lily   False

In [43]:
employee_data = {
    "Name": ["Liu", "Robin", "Rosa", "Rice", "Scott"],
    "Age": [32, 35, 36, 38, 42],
    "Location": ["DHK", "CTG", "CM", "KL", "RS"],
    "Qualification": ["MBA", "MA", "BBA", "BSc", "MEng"],
}

In [45]:
df = pd.DataFrame(employee_data)

In [46]:
print(df)

    Name  Age Location Qualification
0    Liu   32      DHK           MBA
1  Robin   35      CTG            MA
2   Rosa   36       CM           BBA
3   Rice   38       KL           BSc
4  Scott   42       RS          MEng

In [49]:
# Grouping DF

# Using groupby function 

df.groupby('Name')
print(df.groupby('Name').groups)

{'Liu': [0], 'Rice': [3], 'Robin': [1], 'Rosa': [2], 'Scott': [4]}

In [50]:
# Multi-attribute grouping 

df.groupby(['Name','Qualification'])

print(df.groupby(['Name','Qualification']).groups)

{('Liu', 'MBA'): [0], ('Rice', 'BSc'): [3], ('Robin', 'MA'): [1], ('Rosa', 'BBA'): [2], ('Scott', 'MEng'): [4]}